app/views/store_items/index.html.haml

              - elsif item.id > 3
                - if UserStoreItem.exists?(user_id: @user.id, store_item_id: item.id)
---
SELECT "store_items".* FROM "store_items"