app/views/games/_map.html.haml

- tiles = game.tiles
- game_users = game.game_users.includes(:user, :current_tile)
---
SELECT "tiles".* FROM "tiles" WHERE "tiles"."game_id" = ?  [["game_id", 3]]
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ?  [["game_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]