app/views/games/show.html.haml

SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 3], ["user_id", 1], ["LIMIT", 1]]
---
      %ul#player-health-list
        - @game.game_users.includes(:user).each do |game_user|