app/channels/chat_channel.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def subscribed
    logger.debug "Subscribed with params: #{params.inspect}"
    game = Game.find_by(id: (params[:game_id]))