app/channels/presence_channel.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def unsubscribed
    game = Game.find_by(id: params[:game_id])