app/controllers/application_controller.rb

  def set_current_user
    @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]