app/controllers/friends_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 3], ["friend_id", 2], ["status", "pending"], ["created_at", "2024-11-30 05:10:09.964774"], ["updated_at", "2024-11-30 05:10:09.964774"]]
---
  def create
    friend = User.find_by(name: params[:friend_name])

    # Check if the user exists
    if friend.nil?
      flash[:alert] = "No user found with the name #{params[:friend_name]}."
      redirect_to friends_path
      return
    end

    # Prevent sending a request to oneself
    if friend == @user
      flash[:alert] = 'You cannot send a friend request to yourself.'
      redirect_to friends_path
      return
    end

    # Prevent duplicate friend requests or requests to existing friends
    if @user.friends.include?(friend) || @user.pending_friends.include?(friend)
      flash[:alert] = "#{friend.name} is already your friend or has a pending request."
      redirect_to friends_path
      return
    end

    # Create the friend request
    if @user.friendships.create(friend: friend)

UPDATE "friendships" SET "status" = ?, "updated_at" = ? WHERE "friendships"."id" = ?  [["status", "accepted"], ["updated_at", "2024-11-30 05:10:36.260501"], ["id", 1]]
---
  def accept
    friendship = @user.received_friend_requests.find_by(user_id: params[:id])
    if friendship&.update(status: 'accepted')