app/controllers/games_controller.rb

  def move
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @game_users = @game.game_users.includes(:user)
    @tiles = @game.tiles.order(:x_coordinate, :y_coordinate)
    current_game_user = @game_users.find_by(user: @current_user)
    @equipment_items = fetch_equipment(current_game_user)

    # Parse the game.context to find the last assistant message
    messages = []
    if @game.context.present?
---
SELECT 1 AS one FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 3], ["user_id", 1], ["LIMIT", 1]]