app/controllers/games_controller.rb

  def create
    if @current_user.shards_balance >= 500
      @game = Game.new(game_params)
      @game.owner = @current_user
      @game.current_turn_user = @current_user

      if @game.save
        @current_user.update_column(:shards_balance, @current_user.shards_balance - 500)
---
INSERT INTO "games" ("name", "context", "current_turn_user_id", "owner_id", "created_at", "updated_at", "join_code", "map_size") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "game_users" ("game_id", "user_id", "health", "equipment", "current_tile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["game_id", 1], ["user_id", 2], ["health", 100], ["equipment", nil], ["current_tile_id", nil], ["created_at", "2024-11-30 05:08:38.553825"], ["updated_at", "2024-11-30 05:08:38.553825"]]
UPDATE "users" SET "shards_balance" = ? WHERE "users"."id" = ?  [["shards_balance", 2000], ["id", 2]]