app/controllers/games_controller.rb

INSERT INTO "game_users" ("game_id", "user_id", "health", "equipment", "current_tile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["game_id", 1], ["user_id", 2], ["health", 100], ["equipment", nil], ["current_tile_id", nil], ["created_at", "2024-11-30 05:08:38.553825"], ["updated_at", "2024-11-30 05:08:38.553825"]]
INSERT INTO "games" ("name", "context", "current_turn_user_id", "owner_id", "created_at", "updated_at", "join_code", "map_size") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    if @current_user.shards_balance >= 40
      @game = Game.new(game_params)
      @game.owner = @current_user
      @game.current_turn_user = @current_user

      # If genre/setting not provided, either set defaults or generate via GPT
      if @game.genre.blank?
        # Example default or GPT generationer here:
        @game.genre = "Fantasy"
      end

      gpt_service = GptDmService.new
      begin
        # Attempt to generate a setting from GPT based on the chosen genre
        generated_setting = gpt_service.generate_setting(@game.genre)
        # If GPT returns nil or empty, use a fallback
        @game.setting = generated_setting.presence || default_setting_for_genre(@game.genre)
      rescue => e
        Rails.logger.error("GPT Setting Generation Failed: #{e.message}")
        # Use a genre-relevant fallback if GPT fails
        @game.setting = default_setting_for_genre(@game.genre)
      end

      # Set a default internal image URL if none is provided
      @game.chat_image_url ||= "login_register_background.jpg"

      if @game.save

UPDATE "users" SET "shards_balance" = ? WHERE "users"."id" = ?  [["shards_balance", 2000], ["id", 2]]
---
        ]
        @game.update!(quests: initial_quests.to_json)
         # Deduct 40 shards from the user's balance
        @current_user.decrement!(:shards_balance, 40)

INSERT INTO "tiles" ("game_id", "x_coordinate", "y_coordinate", "tile_type", "image_reference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
        starting_tile = @game.tiles.find_by(x_coordinate: 0, y_coordinate: 0)
        Rails.logger.debug "Starting tile: #{starting_tile.inspect}"

        game_user = @game.game_users.create(
          user: @current_user,
          health: 100,
          current_tile: starting_tile
        )

SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 3], ["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "tiles".* FROM "tiles" WHERE "tiles"."game_id" = ?  [["game_id", 3]]
---
  def show
    @game_users = @game.game_users.includes(:user)
    @tiles = @game.tiles.order(:x_coordinate, :y_coordinate)
    current_game_user = @game_users.find_by(user: @current_user)
    @equipment_items = fetch_equipment(current_game_user)

    # Parse the game.context to find the last assistant message
    messages = []
    if @game.context.present?

SELECT 1 AS one FROM "game_users" WHERE "game_users"."game_id" = ? AND "game_users"."user_id" = ? LIMIT ?  [["game_id", 3], ["user_id", 1], ["LIMIT", 1]]
---
    active_user_ids.map!(&:to_i)

    active_users = User.where(id: active_user_ids)
    if active_users.present?