app/controllers/landing_controller.rb

  def index
    @games = @current_user.games.includes(:game_users).order(created_at: :desc)
---
SELECT "game_users".* FROM "game_users" WHERE "game_users"."game_id" IN (?, ?, ?)  [["game_id", 3], ["game_id", 2], ["game_id", 1]]
SELECT "games".* FROM "games" INNER JOIN "game_users" ON "games"."id" = "game_users"."game_id" WHERE "game_users"."user_id" = ? ORDER BY "games"."created_at" DESC  [["user_id", 1]]