app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
---
  def create
    Rails.logger.debug "Email parameter received: #{params[:email]}"
    @user = User.find_by(email: params[:email].downcase)

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-11-16 06:07:14.735657"], ["id", 1]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      redirect_to :edit
    elsif @user.update(user_params)