app/controllers/settings_controller.rb

  def settings
    @billing_methods = @current_user.billing_methods
    @billing_method = BillingMethod.new
    @orders = @current_user.orders.order(purchased_at: :desc) # Retrieve user orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."purchased_at" DESC  [["user_id", 4]]