app/controllers/settings_controller.rb

INSERT INTO "billing_methods" ("user_id", "card_number", "card_holder_name", "expiration_date", "created_at", "updated_at", "cvv") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "billing_methods".* FROM "billing_methods" WHERE "billing_methods"."user_id" = ?  [["user_id", 2]]
---
  def add_billing_method
    @billing_method = @current_user.billing_methods.new(billing_method_params)

    if @billing_method.save
      flash[:success] = "Billing method added successfully."
    else
      flash[:danger] = @billing_method.errors.full_messages.join(", ")

SELECT "billing_methods".* FROM "billing_methods" WHERE "billing_methods"."user_id" = ? AND "billing_methods"."id" = ? LIMIT ?  [["user_id", 2], ["id", 11], ["LIMIT", 1]]
UPDATE "billing_methods" SET "expiration_date" = ?, "updated_at" = ? WHERE "billing_methods"."id" = ?  [["expiration_date", "2024-12-06"], ["updated_at", "2024-12-07 01:48:57.579130"], ["id", 6]]
---
  def edit_billing_method
    @billing_method = @current_user.billing_methods.find(params[:id])

    if @billing_method.update(billing_method_params)

SELECT "billing_methods".* FROM "billing_methods" WHERE "billing_methods"."user_id" = ? AND "billing_methods"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
DELETE FROM "billing_methods" WHERE "billing_methods"."id" = ?  [["id", 6]]
---
  def delete_billing_method
    @billing_method = @current_user.billing_methods.find(params[:id])

    if @billing_method.destroy

UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2024-11-29 23:13:53.398514"], ["id", 1]]
---
  def update_profile_image
    @user = @current_user

    if params[:profile_image].present?
      if @user.update(profile_image: params[:profile_image])

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "NewName"], ["updated_at", "2024-11-29 23:13:53.485856"], ["id", 1]]
---
  def update_name
    @user = @current_user

    if params[:name].present? && @user.update(name: params[:name])

UPDATE "users" SET "email" = ? WHERE "users"."id" = ?  [["email", "[FILTERED]"], ["id", 1]]
---
  def change_email

    # Check if password is provided
    unless params[:current_password].present?
      flash[:danger] = "Current password is required."
      redirect_to settings_path and return
    end

    # Verify the password
    unless @current_user.authenticate(params[:current_password])
      flash[:danger] = "Incorrect password. Please try again."
      redirect_to settings_path and return
    end

    # Check if new email and confirmation match
    unless params[:new_email] == params[:confirm_email]
      flash[:danger] = "Emails do not match."
      redirect_to settings_path and return
    end

    # Update the email without triggering validations
    if @current_user.update_columns(email: params[:new_email]) # Skips validations