app/controllers/store_items_controller.rb

  def index
    @store_items = StoreItem.all
---
SELECT "store_items".* FROM "store_items"

  def purchase
    shard_amount = params[:shard_amount].to_i

    user = current_user  # Adjust based on how you get the current user

    if user.shards_balance >= 0
      user.update_column(:shards_balance, user.shards_balance + shard_amount)
---
UPDATE "users" SET "shards_balance" = ? WHERE "users"."id" = ?  [["shards_balance", 250], ["id", 2]]

  def current_user
    session_token = session[:session_token]
    User.find_by(session_token: session_token) if session_token.present?
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]