app/controllers/store_items_controller.rb

  def purchase
    shard_amount = params[:shard_amount].to_i
    item_id = params[:item_id].to_i
    user = current_user
    item = StoreItem.find_by(id: item_id)

    # Handle shard packages
    if [10, 20, 50].include?(shard_amount)
      if BillingMethod.exists?(user_id: current_user.id)
        user.increment!(:shards_balance, shard_amount)
        Order.create!(
          user: user,
          item_name: "#{shard_amount} Shards",
          item_type: "Shard Package",
          item_cost: shard_amount,
          purchased_at: Time.zone.now
        )
---
SELECT "store_items".* FROM "store_items" WHERE "store_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT 1 AS one FROM "billing_methods" WHERE "billing_methods"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
UPDATE "users" SET "shards_balance" = COALESCE("shards_balance", 0) - ? WHERE "users"."id" = ?  [["shards_balance", 1], ["id", 1]]
INSERT INTO "orders" ("user_id", "item_name", "item_type", "item_cost", "purchased_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def current_user
    session_token = session[:session_token]
    User.find_by(session_token: session_token) if session_token.present?
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]