app/controllers/store_items_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def current_user
    session_token = session[:session_token]
    User.find_by(session_token: session_token) if session_token.present?