app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "email", "created_at", "updated_at", "session_token", "reset_digest", "reset_sent_at", "uid", "shards_balance", "teleport", "health_potion", "resurrection_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save