app/models/game.rb

INSERT INTO "tiles" ("game_id", "x_coordinate", "y_coordinate", "tile_type", "image_reference", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def generate_tiles
    rows, columns = map_size.split('x').map(&:to_i)
    (0..rows).each do |x|
      (0..columns).each do |y|
        tiles.create!(
          x_coordinate: x,
          y_coordinate: y,
          tile_type: default_tile_type
        )